[{"title":"System Design Interview – An Insider's Guide: Volume 2","price":39.23,"image":"https://m.media-amazon.com/images/I/51XdrsXkWML.jpg","description":"Do you want to recycle your electrical and electronic equipment for free? Learn more<br><br>System Design Interview - An Insider's Guide (Volume 2)<br><br>This book can be seen as a sequel to the book: System Design Interview - An Insider’s Guide. It covers a different set of system design interview questions and solutions. Although reading Volume 1 is helpful, it is not required. This book should be accessible to readers who have a basic understanding of distributed systems.<br><br>This volume provides a reliable strategy and knowledge base for approaching a broad range of system design questions that you may encounter. It will help you feel confident during this important interview. This book provides a step-by-step framework for how to tackle a system design question. It also includes many real-world examples to illustrate a systematic approach, with detailed and well-explained steps you can follow.<br><br>What’s inside?<br>- An insider’s take on what interviewers really look for and why.<br>- A 4-step framework for solving any system design interview question.<br>- 13 real system design interview questions with detailed solutions.<br>- 300+ diagrams to visually explain how different systems work.<br><br>Table of Contents<br>Chapter 1: Proximity Service<br>Chapter 2: Nearby Friends<br>Chapter 3: Google Maps<br>Chapter 4: Distributed Message Queue<br>Chapter 5: Metrics Monitoring<br>Chapter 6: Ad Click Event Aggregation<br>Chapter 7: Hotel Reservation<br>Chapter 8: Distributed Email Service<br>Chapter 9: S3-like Object Storage<br>Chapter 10: Real-time Gaming Leaderboard<br>Chapter 11: Payment System<br>Chapter 12: Digital Wallet<br>Chapter 13: Stock Exchange","id":"00000001"},{"title":"System Design Interview – An insider's guide","price":39.22,"image":"https://m.media-amazon.com/images/I/51xUZItrHJL.jpg","description":"Do you want to recycle your electrical and electronic equipment for free? Learn more<br><br>System Design Interview - An Insider's Guide (Volume 1)<br><br>System design interviews are the most difficult to tackle of all technical interview questions. This book is Volume 1 of the System Design Interview - An insider’s guide series that provides a reliable strategy and knowledge base for approaching a broad range of system design questions. This book provides a step-by-step framework for how to tackle a system design question. It includes many real-world examples to illustrate the systematic approach, with detailed steps that you can follow.<br><br>What’s inside?<br>- An insider’s take on what interviewers really look for and why.<br>- A 4-step framework for solving any system design interview question.<br>- 16 real system design interview questions with detailed solutions.<br>- 188 diagrams to visually explain how different systems work.<br><br>Table Of Contents<br>Chapter 1: Scale From Zero To Millions Of Users<br>Chapter 2: Back-of-the-envelope Estimation<br>Chapter 3: A Framework For System Design Interviews<br>Chapter 4: Design A Rate Limiter<br>Chapter 5: Design Consistent Hashing<br>Chapter 6: Design A Key-value Store<br>Chapter 7: Design A Unique Id Generator In Distributed Systems<br>Chapter 8: Design A Url Shortener<br>Chapter 9: Design A Web Crawler<br>Chapter 10: Design A Notification System<br>Chapter 11: Design A News Feed System<br>Chapter 12: Design A Chat System<br>Chapter 13: Design A Search Autocomplete System<br>Chapter 14: Design Youtube<br>Chapter 15: Design Google Drive<br>Chapter 16: The Learning Continues","id":"00000002"},{"title":"Cracking the Coding Interview, 6th Edition: 189 Programming Questions and Solutions (Cracking the Interview & Career)","price":35.19,"image":"https://m.media-amazon.com/images/I/61mIq2iJUXL.jpg","description":"Do you want to recycle your electrical and electronic equipment for free? Learn more<br><br>I am not a recruiter. I am a software engineer. And as such, I know what it's like to be asked to whip up brilliant algorithms on the spot and then write flawless code on a whiteboard. I've been through this—as a candidate and as an interviewer.<br><br>Cracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book.<br><br>Learn how to uncover the hints and hidden details in a question, discover how to break down a problem into manageable chunks, develop techniques to unstick yourself when stuck, learn (or re-learn) core computer science concepts, and practice on 189 interview questions and solutions.<br><br>These interview questions are real; they are not pulled out of computer science textbooks. They reflect what’s truly being asked at the top companies, so that you can be as prepared as possible.<br><br>WHAT'S INSIDE?<br>189 programming interview questions, ranging from the basics to the trickiest algorithm problems.<br>A walk-through of how to derive each solution, so that you can learn how to get there yourself.<br>Hints on how to solve each of the 189 questions, just like what you would get in a real interview.<br>Five proven strategies to tackle algorithm questions, so that you can solve questions you haven’t seen.<br>Extensive coverage of essential topics, such as big O time, data structures, and core algorithms.<br>A “behind the scenes” look at how top companies, like Google and Facebook, hire developers.<br>Techniques to prepare for and ace the “soft” side of the interview: behavioral questions.<br>For interviewers and companies: details on what makes a good interview question and hiring process.","id":"00000003"},{"title":"Fluent Python: Clear, Concise, and Effective Programming","price":46.99,"image":"https://m.media-amazon.com/images/I/81OvszBEdhL.jpg","description":"Do you want to recycle your electrical and electronic equipment for free? Learn more<br><br>Don't waste time bending Python to fit patterns you've learned in other languages. Python's simplicity lets you become productive quickly, but often this means you aren't using everything the language has to offer. With the updated edition of this hands-on guide, you'll learn how to write effective, modern Python 3 code by leveraging its best ideas.<br><br>Discover and apply idiomatic Python 3 features beyond your past experience. Author Luciano Ramalho guides you through Python's core language features and libraries and teaches you how to make your code shorter, faster, and more readable.<br><br>Complete with major updates throughout, this new edition features five parts that work as five short books within the book:<br><br>Data structures: Sequences, dicts, sets, Unicode, and data classes<br>Functions as objects: First-class functions, related design patterns, and type hints in function declarations<br>Object-oriented idioms: Composition, inheritance, mixins, interfaces, operator overloading, protocols, and more static types<br>Control flow: Context managers, generators, coroutines, async/await, and thread/process pools<br>Metaprogramming: Properties, attribute descriptors, class decorators, and new class metaprogramming hooks that replace or simplify metaclasses","id":"00000004"},{"title":"Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow: Concepts, Tools, and Techniques to Build Intelligent Systems","price":60.57,"image":"https://m.media-amazon.com/images/I/81uOhAWWbHL.jpg","description":"Do you want to recycle your electrical and electronic equipment for free? Learn more<br><br>Through a recent series of breakthroughs, deep learning has boosted the entire field of machine learning. Now, even programmers who know close to nothing about this technology can use simple, efficient tools to implement programs capable of learning from data. This bestselling book uses concrete examples, minimal theory, and production-ready Python frameworks (Scikit-Learn, Keras, and TensorFlow) to help you gain an intuitive understanding of the concepts and tools for building intelligent systems.<br>With this updated third edition, author Aurélien Géron explores a range of techniques, starting with simple linear regression and progressing to deep neural networks. Numerous code examples and exercises throughout the book help you apply what you've learned. Programming experience is all you need to get started.<br><br>Use Scikit-learn to track an example ML project end to end<br>Explore several models, including support vector machines, decision trees, random forests, and ensemble methods<br>Exploit unsupervised learning techniques such as dimensionality reduction, clustering, and anomaly detection<br>Dive into neural net architectures, including convolutional nets, recurrent nets, generative adversarial networks, autoencoders, diffusion models, and transformers<br>Use TensorFlow and Keras to build and train neural nets for computer vision, natural language processing, generative models, and deep reinforcement learning","id":"00000005"},{"title":"Javascript: The Definitive Guide: Master the World's Most-Used Programming Language","price":50.90,"image":"https://m.media-amazon.com/images/I/71sz1KTSlqL.jpg","description":"Do you want to recycle your electrical and electronic equipment for free? Learn more<br><br>JavaScript is the programming language of the web and is used by more software developers today than any other programming language. For nearly 25 years this best seller has been the go-to guide for JavaScript programmers. The seventh edition is fully updated to cover the 2020 version of JavaScript, and new chapters cover classes, modules, iterators, generators, Promises, async/await, and metaprogramming. You&;ll find illuminating and engaging example code throughout.<br><br>This book is for programmers who want to learn JavaScript and for web developers who want to take their understanding and mastery to the next level. It begins by explaining the JavaScript language itself, in detail, from the bottom up. It then builds on that foundation to cover the web platform and Node.js.<br><br>Topics include:<br><br>Types, values, variables, expressions, operators, statements, objects, and arrays<br>Functions, classes, modules, iterators, generators, Promises, and async/await<br>JavaScript&;s standard library: data structures, regular expressions, JSON, i18n, etc.<br>The web platform: documents, components, graphics, networking, storage, and threads<br>Node.js: buffers, files, streams, threads, child processes, web clients, and web servers<br>Tools and language extensions that professional JavaScript developers rely on","id":"00000006"},{"title":"Programming TypeScript: Making Your JavaScript Applications Scale","price":39.75,"image":"https://m.media-amazon.com/images/I/71JdK8LhJJL.jpg","description":"Do you want to recycle your electrical and electronic equipment for free? Learn more<br><br>Any programmer working with a dynamically typed language will tell you how hard it is to scale to more lines of code and more engineers. That’s why Facebook, Google, and Microsoft invented gradual static type layers for their dynamically typed JavaScript and Python code. This practical book shows you how one such type layer, TypeScript, is unique among them: it makes programming fun with its powerful static type system.<br><br>If you’re a programmer with intermediate JavaScript experience, author Boris Cherny will teach you how to master the TypeScript language. You’ll understand how TypeScript can help you eliminate bugs in your code and enable you to scale your code across more engineers than you could before.<br><br>In this book, you’ll:<br><br>Start with the basics: Learn about TypeScript’s different types and type operators, including what they’re for and how they’re used<br>Explore advanced topics: Understand TypeScript’s sophisticated type system, including how to safely handle errors and build asynchronous programs<br>Dive in hands-on: Use TypeScript with your favorite frontend and backend frameworks, migrate your existing JavaScript project to TypeScript, and run your TypeScript application in production","id":"00000007"}]